# **Adding New column**

1. Use square brackets
2. df["colm name"] = some_data

In [ ]:
import pandas as pd

data= {
    "Name": ['Akash', 'Ahad', 'Hossain', 'Aminul', 'Nayem', 'Nazmul', 'Megh', 'Nabil'],
    "Age": [25,24,19,55,30,35,15,50],
    "Profession":["Student", 'Software Engineer', 'Teacher', 'Retair Person', 'Hospital incharge', 'HouseHold', 'A-level student', 'Marketing head'],
    "Salary": [20000,70000,30000,15000,28000,5000,8000,50000],
    "Performance": [88,90,85,77,92,81,77,89]
}
df= pd.DataFrame(data)
print(df)
df["Bonus"] = df["Salary"] * 0.1
print("Updated Table: ")
print(df)

      Name  Age         Profession  Salary  Performance
0    Akash   25            Student   20000           88
1     Ahad   24  Software Engineer   70000           90
2  Hossain   19            Teacher   30000           85
3   Aminul   55      Retair Person   15000           77
4    Nayem   30  Hospital incharge   28000           92
5   Nazmul   35          HouseHold    5000           81
6     Megh   15    A-level student    8000           77
7    Nabil   50     Marketing head   50000           89
Updated Table:
      Name  Age         Profession  Salary  Performance   Bonus
0    Akash   25            Student   20000           88  2000.0
1     Ahad   24  Software Engineer   70000           90  7000.0
2  Hossain   19            Teacher   30000           85  3000.0
3   Aminul   55      Retair Person   15000           77  1500.0
4    Nayem   30  Hospital incharge   28000           92  2800.0
5   Nazmul   35          HouseHold    5000           81   500.0
6     Megh   15    A-level student    8000           77   800.0
7    Nabil   50     Marketing head   50000           89  5000.0

**Using insert**

df.insert(location, "col name", some data)

In [ ]:
df.insert(0, "Member_ID", [10,20,30,40,50,60,70,80])

In [ ]:
print(df)

   Member_ID  Family_ID     Name  Age         Profession  Salary  Performance  \
0         10          1    Akash   25            Student   20000           88
1         20          2     Ahad   24  Software Engineer   70000           90
2         30          3  Hossain   19            Teacher   30000           85
3         40          4   Aminul   55      Retair Person   15000           77
4         50          5    Nayem   30  Hospital incharge   28000           92
5         60          6   Nazmul   35          HouseHold    5000           81
6         70          7     Megh   15    A-level student    8000           77
7         80          8    Nabil   50     Marketing head   50000           89

    Bonus
0  2000.0
1  7000.0
2  3000.0
3  1500.0
4  2800.0
5   500.0
6   800.0
7  5000.0

# **Removing Column:**
df.drop(column = ["column_name"]).inpalace=True

In [ ]:
df.drop(columns = ["Family_ID"], inplace=True)

In [ ]:
print(df)

   Member_ID     Name  Age         Profession  Salary  Performance   Bonus
0         10    Akash   25            Student   20000           88  2000.0
1         20     Ahad   24  Software Engineer   70000           90  7000.0
2         30  Hossain   19            Teacher   30000           85  3000.0
3         40   Aminul   55      Retair Person   15000           77  1500.0
4         50    Nayem   30  Hospital incharge   28000           92  2800.0
5         60   Nazmul   35          HouseHold    5000           81   500.0
6         70     Megh   15    A-level student    8000           77   800.0
7         80    Nabil   50     Marketing head   50000           89  5000.0

# **Handaling MIssing Data:**


1.   NaN(Not a Number)
2.   None(For Object data types)


First we have to identify the missing data, using isnull() method:
 1. if it provide ** true ** means it is ** NaN **
 2. if it provide ** False ** means it has ** no missing value **.

In [5]:
import pandas as pd

data= {
    "Name": [None, 'Ahad', 'Hossain', 'Aminul', 'Nayem', 'Nazmul', 'Megh', 'Nabil'],
    "Age": [None,24,19,55,30,35,15,50],
    "Profession":[None, 'Software Engineer', 'Teacher', 'Retair Person', 'Hospital incharge', 'HouseHold', 'A-level student', 'Marketing head'],
    "Salary": [None,70000,30000,15000,28000,5000,8000,50000],
    "Performance": [None,90,85,77,92,81,77,89]
}
df= pd.DataFrame(data)
print(df)
print(df.isnull()) # just check which are missing value
print("Count the missing value: ")
print(df.isnull().sum()) # count the missing value

      Name   Age         Profession   Salary  Performance
0     None   NaN               None      NaN          NaN
1     Ahad  24.0  Software Engineer  70000.0         90.0
2  Hossain  19.0            Teacher  30000.0         85.0
3   Aminul  55.0      Retair Person  15000.0         77.0
4    Nayem  30.0  Hospital incharge  28000.0         92.0
5   Nazmul  35.0          HouseHold   5000.0         81.0
6     Megh  15.0    A-level student   8000.0         77.0
7    Nabil  50.0     Marketing head  50000.0         89.0
    Name    Age  Profession  Salary  Performance
0   True   True        True    True         True
1  False  False       False   False        False
2  False  False       False   False        False
3  False  False       False   False        False
4  False  False       False   False        False
5  False  False       False   False        False
6  False  False       False   False        False
7  False  False       False   False        False
Count the missing value:
Name           1
Age            1
Profession     1
Salary         1
Performance    1
dtype: int64

**For Handling this, Main solution is:**

Delete the column if it's nothing change in dataset.
**using dropna() method:**

1. df.dropna(axis=0,inplace= True)  # missing value of row
2. df.dropna(axis=1,inplace= True)  # missing value of column

In [6]:
df.dropna(axis=0,inplace= True)

In [7]:
print(df)

      Name   Age         Profession   Salary  Performance
1     Ahad  24.0  Software Engineer  70000.0         90.0
2  Hossain  19.0            Teacher  30000.0         85.0
3   Aminul  55.0      Retair Person  15000.0         77.0
4    Nayem  30.0  Hospital incharge  28000.0         92.0
5   Nazmul  35.0          HouseHold   5000.0         81.0
6     Megh  15.0    A-level student   8000.0         77.0
7    Nabil  50.0     Marketing head  50000.0         89.0

# **Replace Empty Values**
Another way of dealing with ** empty cells or missing value ** is to insert a new value instead.

This way you do not have to delete entire rows just because of some empty cells.

The `fillna()` method allows us to replace empty cells with a value:

In [8]:
import pandas as pd

data= {
    "Name": [None, 'Ahad', 'Hossain', 'Aminul', 'Nayem', 'Nazmul', 'Megh', 'Nabil'],
    "Age": [None,24,19,55,30,35,15,50],
    "Profession":[None, 'Software Engineer', 'Teacher', 'Retair Person', 'Hospital incharge', 'HouseHold', 'A-level student', 'Marketing head'],
    "Salary": [None,70000,30000,15000,28000,5000,8000,50000],
    "Performance": [None,90,85,77,92,81,77,89]
}
df= pd.DataFrame(data)
print(df)
print(df.isnull()) # just check which are missing value
print("Count the missing value: ")
print(df.isnull().sum()) # count the missing value

      Name   Age         Profession   Salary  Performance
0     None   NaN               None      NaN          NaN
1     Ahad  24.0  Software Engineer  70000.0         90.0
2  Hossain  19.0            Teacher  30000.0         85.0
3   Aminul  55.0      Retair Person  15000.0         77.0
4    Nayem  30.0  Hospital incharge  28000.0         92.0
5   Nazmul  35.0          HouseHold   5000.0         81.0
6     Megh  15.0    A-level student   8000.0         77.0
7    Nabil  50.0     Marketing head  50000.0         89.0
    Name    Age  Profession  Salary  Performance
0   True   True        True    True         True
1  False  False       False   False        False
2  False  False       False   False        False
3  False  False       False   False        False
4  False  False       False   False        False
5  False  False       False   False        False
6  False  False       False   False        False
7  False  False       False   False        False
Count the missing value:
Name           1
Age            1
Profession     1
Salary         1
Performance    1
dtype: int64

In [11]:
#print(df.fillna(0, inplace=True))  #Default value
# Replace Using Mean, Median, or Mode
x= df["Age"].mean()
df["Age"].fillna(x, inplace=True)

/tmp/ipython-input-1699289968.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Age"].fillna(x, inplace=True)

In [12]:
print(df)

      Name   Age         Profession   Salary  Performance
0        0   0.0                  0      0.0          0.0
1     Ahad  24.0  Software Engineer  70000.0         90.0
2  Hossain  19.0            Teacher  30000.0         85.0
3   Aminul  55.0      Retair Person  15000.0         77.0
4    Nayem  30.0  Hospital incharge  28000.0         92.0
5   Nazmul  35.0          HouseHold   5000.0         81.0
6     Megh  15.0    A-level student   8000.0         77.0
7    Nabil  50.0     Marketing head  50000.0         89.0

# **Interpolation**
1. Linear interpolation
2. Polynomial  interpolation
3. Time interpolation

What is do actualy:
1. Predict estimated value and fill it. Like, 10,20,NaN,40,50 --->> it automatically predict 30 and fill it up.
2. Smooth trends. IF a shop do every year calculation but unfortunately missing one year value then it done this automatically.
3. Avoid Data loss.

`interpolate()` method for this

In [14]:
import pandas as pd

data= {
    "Name": ['Akash', 'Ahad', 'Hossain', 'Aminul', 'Nayem', 'Nazmul', 'Megh', 'Nabil'],
    "Age": [25,24,19,55,30,35,15,50],
    "Profession":['Student', 'Software Engineer', 'Teacher', 'Retair Person', 'Hospital incharge', 'HouseHold', 'A-level student', 'Marketing head'],
    "Salary": [None,70000,30000,15000,28000,5000,8000,50000],
    "Performance": [None,90,85,77,92,81,77,89]
}
df= pd.DataFrame(data)
print(df)
df.interpolate(method="linear",axis=0, inplace=True)
print(df)

      Name  Age         Profession   Salary  Performance
0    Akash   25            Student      NaN          NaN
1     Ahad   24  Software Engineer  70000.0         90.0
2  Hossain   19            Teacher  30000.0         85.0
3   Aminul   55      Retair Person  15000.0         77.0
4    Nayem   30  Hospital incharge  28000.0         92.0
5   Nazmul   35          HouseHold   5000.0         81.0
6     Megh   15    A-level student   8000.0         77.0
7    Nabil   50     Marketing head  50000.0         89.0
      Name  Age         Profession   Salary  Performance
0    Akash   25            Student      NaN          NaN
1     Ahad   24  Software Engineer  70000.0         90.0
2  Hossain   19            Teacher  30000.0         85.0
3   Aminul   55      Retair Person  15000.0         77.0
4    Nayem   30  Hospital incharge  28000.0         92.0
5   Nazmul   35          HouseHold   5000.0         81.0
6     Megh   15    A-level student   8000.0         77.0
7    Nabil   50     Marketing head  50000.0         89.0

/tmp/ipython-input-2884200700.py:12: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method="linear",axis=0, inplace=True)